include("../src/Operation.jl")
using .Operation
using Test

@testset "Operation.jl" begin
    @test Operation.str2num("1 1 1 1", 2, 2) == [1 1; 1 1] #Квадратная
    @test Operation.str2num("1 1 1 1 1 1", 3, 2) == [1 1; 1 1; 1 1] #Для не квадратной
    @test Operation.transH("1 2 3 4", 2, 2) == [1 3; 2 4]#Транспонирование квадратной
    @test Operation.transH("1 2 3 4 5 6", 3, 2) == [1 3 5; 2 4 6]#Транспанирование не квадратной
    @test Operation.dethelp([1.0 2.0 3.0; 4.0 5.0 6.0; 7.0 8.0 9.0], 1, 1) == [5 6; 8 9]#Убрать строку и столбец
    @test Operation.det("1 1 1 1", 2, 2) == 0#Определитель единичной
    @test Operation.det("1 1 1 1 1 1", 3, 2) == "Матрица должна быть квадратной"#Ошибка ввода
    @test Operation.det("2 2 3 1 5 6 2 4 3", 3, 3) == -18#Произвольный определитель
    @test Operation.tr("1 1 1 1", 2, 2) == 2#След единичной
    @test Operation.tr("1 1 1 1 1 1", 3, 2) == "Матрица должна быть квадратной"#Ошибка ввода
    @test Operation.tr("1 2 3 4", 2, 2) == 5#След произвольной
    @test Operation.rang("2 2 3 1 5 6 2 4 3", 3, 3) == 3#Ранг произвольной
    @test Operation.rang("1 1 1 1", 2, 2) == 1#Ранг единичной
    @test Operation.obr("1 1 1 1", 2, 2) == "Определитель равен нулю"# Ошибка ввода
    @test Operation.obr("1 1 1 2", 2, 2) == [2 -1; -1 1]#Обратная произвольной
    @test Operation.obr("1 1 1 1 1 1", 3, 2) == "Матрица должна быть квадратной"#Ошибка ввода
    @test Operation.mul("1 1 1 1", 2, 2, "1 1 1 1", 2, 2) == [2 2; 2 2]#Умножение единичных
    @test Operation.mul("1 1 1 1 1 1", 3, 2, "1 1 1 1", 2, 2) == [2 2; 2 2; 2 2]#Умножение столбцы первой равны строкам второй
    @test Operation.mul("1 1 1 1 1 1", 2, 3, "1 1 1 1", 2, 2) == "Количество столбцов первой матрицы должно быть равно количеству строк второй"#Ошибка ввода
    @test Operation.mul("1 2 3 4", 2, 2, "2 11 5 5", 2, 2) == [12 21; 26 53]#Умножение произвольных
    @test Operation.plus("1 1 1 1", 2, 2, "1 1 1 1", 2, 2) == [2 2; 2 2]#Сложение единичных
    @test Operation.plus("1 1 1 1 1 1", 3, 3, "1 1 1 1", 2, 2) == "Размеры матриц должны совпадать"#Ошибка ввода
    @test Operation.plus("1 2 3 4", 2, 2, "1 2 3 4", 2, 2) == [2 4; 6 8]#Сложение произвольных
    @test Operation.minus("1 1 1 1", 2, 2, "1 1 1 1", 2, 2) == [0 0; 0 0]#Разность единичных
    @test Operation.minus("1 1 1 1 1 1", 3, 3, "1 1 1 1", 2, 2) == "Размеры матриц должны совпадать"#Ошибка ввода
    @test Operation.minus("2 2 13 5", 2, 2, "2 1 5 45", 2, 2) == [0 1; 8 -40]#Разность произвольных
    @test Operation.float_to_frac(5) == 5#Преобразование обычного числа
    @test Operation.float_to_frac(1.5) == "3/2"#Преобразование дроби > 1
    @test Operation.float_to_frac(0.000000001) == 0#Преобразование с выходом за погрешность
    @test Operation.float_to_frac(0.005) == "1/200"#Преобразование дроби < 1
    @test Operation.float_to_frac(0.6666666666) == "2/3"#преобразование периодической лроби
end
